tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "materializeinc/crosstools"
tap "pulumi/tap"
tap "redis-developer/tap"
tap "shopify/shopify"
tap "weaveworks/tap"

brew "zstd"
brew "jpeg-xl"
brew "aom"
brew "argocd"
brew "btop"
brew "pycparser"
brew "cffi"
brew "docutils"
brew "python@3.11"
brew "awscli"
brew "fontconfig"
brew "python@3.12"
brew "circleci"
brew "cmake"
brew "cryptography"
brew "fish"
brew "fzf"
brew "libavif"
brew "gd"
brew "gimme-aws-creds"
brew "qt"
brew "gnuplot"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "netpbm"
brew "gts"
brew "graphviz"
brew "grpcurl"
brew "helm"
brew "helmfile"
brew "jq"
brew "just"
brew "k9s"
brew "zookeeper"
brew "kafka"
brew "librdkafka"
brew "kcat"
brew "krb5"
brew "kubernetes-cli"
brew "kubectx"
brew "lazygit"
brew "libpq", link: true
brew "libssh"
brew "linkerd"
brew "maven"
brew "neofetch"
brew "neovim"
brew "okta-aws-cli"
brew "openssl@1.1"
brew "virtualenv"
brew "pdm"
brew "postgresql@14", link: false
brew "pre-commit"
brew "protobuf"
brew "pulumi"
brew "pyenv"
brew "python@3.10"
brew "qemu"
brew "qt@5"
brew "ripgrep"
brew "sops"
brew "starship"
brew "step"
brew "stern"
brew "stow"
brew "thefuck"
brew "tilt"
brew "tmux"
brew "yq"
brew "zellij"
brew "zplug"
brew "heroku/brew/heroku"
brew "materializeinc/crosstools/aarch64-unknown-linux-gnu"
brew "redis-developer/tap/riot"
brew "shopify/shopify/ejson"
brew "shopify/shopify/ejson2env"
brew "weaveworks/tap/eksctl"

cask_args appdir: "~/Applications", require_sha: true

# Alacritty binaries aren't notarized on mac
# See: https://github.com/alacritty/alacritty/issues/4673
cask "alacritty", args: { no_quarantine: true }
cask "dbeaver-community"
cask "font-jetbrains-mono-nerd-font"
cask "obsidian"

vscode "bierner.markdown-mermaid"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "formulahendry.terminal"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cpptools"
vscode "prisma.prisma"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "samverschueren.ava"
vscode "skellock.just"
vscode "tamasfe.even-better-toml"
vscode "tilt-dev.tiltfile"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
